tap "homebrew/services"
brew "bat"
brew "eza"
brew "fzf"
brew "gh"
brew "glow"
brew "go"
brew "neovim"
brew "node"
brew "pandoc"
brew "pre-commit"
brew "pyenv"
brew "ripgrep"
brew "starship"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "1password"
cask "alfred"
cask "chatgpt"
cask "claude"
cask "discord"
cask "docker-desktop"
cask "ghostty"
cask "google-chrome"
cask "iterm2"
cask "ledger-live"
cask "messenger"
cask "microsoft-azure-storage-explorer"
cask "notion"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"
cask "whatsapp"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "alefragnani.bookmarks"
vscode "asvetliakov.vscode-neovim"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ritwickdey.liveserver"
vscode "vscodevim.vim"
